{
    "Oklahoma": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "S 1543", 
        "Description": "Prohibits state, government agencies, political subdivisions, public benefit corporations, or municipalities from purchasing of Internet services from providers that do not adhere to net neutrality principles; establishes procedures for the purchase of internet services through certain contracts; establishes grievance procedures for certain contracts; excludes certain contracts from the act; creates the Municipal Internet Service Provider Loan Fund; appropriates certain amount to fund. ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "S 1543", 
        "Date": "02/05/2018", 
        "Title (IGNORE)": "Oklahoma Net Neutrality Protection Act", 
        "Sponsor(s)": "Pittman (D)", 
        "Type": "Bill"
    }, 
    "Delaware": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SCR 44", 
        "Description": "Expresses the General Assembly’s opposition to the FCC’s repeal of net neutrality rules and urges Congress to either review the repeal under the Congressional Review Act or enact legislation reinstating and requiring the preservation of net neutrality.", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "SCR 44", 
        "Date": "1/25/2018", 
        "Title (IGNORE)": "Opposing the Federal Communication Commission's Repeal of Net Neutrality rules intended to protect consumers and ensure fair and reasonable access to the internet", 
        "Sponsor(s)": "Sen. Delcollo (R), Sen. Richardson (R), Sen. Townsend (D), Rep. Bennett (D), Rep. Briggs King (R), ", 
        "Type": "Resolution"
    }, 
    "Minnesota": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SF2880", 
        "Description": "Relates to broadband service. Prohibits certain activities by Internet service proviers serving Minnsesota customers and those under contract to the state or political subdivisions", 
        "Bipartisan?": "", 
        "Legislation (highlight=confirmed)": "SF 2880 (companion to HF 3033)", 
        "Date": "3/1/2018", 
        "Title (IGNORE)": "", 
        "Sponsor(s)": "Latz (D), Little (D), Newton (D), Wiklund (D), Hawj (D)", 
        "Type": "Bill"
    }, 
    "Illinois": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HR 0874", 
        "Description": "Urges the President, Congress, and all relevant federal offices to continue to protect net neutrality and open Internet access.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HR 874", 
        "Date": "2/27/2018", 
        "Title (IGNORE)": "", 
        "Sponsor(s)": "Ammons (D), Slaughter (D)", 
        "Type": "Resolution"
    }, 
    "New Mexico": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SB 155", 
        "Description": "Amends the Unfair Practices Act making it unlawful for any broadband service provider to block unlawful content, applications, services, or use a nonharmful device, impair or degrade lawful internet traffic, engage in paid prioritization, or unreasonable interfere with or unreasonably disadvantage user's ability to select and access internet service, make lawful content, etc. ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "SB 155", 
        "Date": "1/23/2018", 
        "Title (IGNORE)": "Broadband Access Unfair Trade Practices", 
        "Sponsor(s)": "Morales (D)", 
        "Type": "Bill"
    }, 
    "Maryland": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 1655", 
        "Description": "Provides that state funds may be used only by the state, a political subdivision, or a unit, an agency, or any instrumentality of the state or a political subdivision or by a person awarded a contract or grant by certain persons to procure services from an Internet Service Provider that does not block certain content applications, services, and devices, impair or degrade certain Internet traffic on a certain basis, or engage in certain commercial traffic preferencing.", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "HB 1655", 
        "Date": "2/9/2018", 
        "Title (IGNORE)": "Commercial Law - Privacy and Net Neutrality Matters ", 
        "Sponsor(s)": "Reznik (D), Sydnor (D), Barve (D), Beidle (D), Bromwell (D), Carr (D), Clippinger (D), Cullison (D), Flanagan (R), Fraser-Hidalgo (D), Gaines (D), Healey (D), Hettleman (D), Krimm (D), J. Lewis (D), Lierman (D), Luedtke (D), A. MIller (D), Moon (D), Morhaim (D), Pena-Melnyk (D), Pendergrass (D), Robinson (D), Stein (D), M. Washington (D), Wilkins (D), K. Young (D), P. Young (D)", 
        "Type": "Bill"
    }, 
    "Idaho": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 0425", 
        "Description": "Rquires ISPs operating in ID to comply with net neutralitry rules and to be transparency about network management practices.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HB 425", 
        "Date": "1/26/2018", 
        "Title (IGNORE)": "An Act Relating to Internet Service Providers", 
        "Sponsor(s)": "Jordan (D)", 
        "Type": "Bill"
    }, 
    "Tennessee": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SB2183", 
        "Description": "Prohibits an Internet service provider from engaging in the following activities when providing Internet service to the state: (1) blocking lawful content, applications, services, or nonharmful devices; (2) impairing or degrading lawful internet traffic on the basis of Internet content, application, or service, or use of nonharmful device; (3) unreasonably interfering with or disadvantaging either the state or state employee's ability to select, access, and use broadband internet access service; or (4) engaging in deceptive or misleading marketing practices that misrepresent the treatment of Internet traffic or content to the state. ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "S 2183", 
        "Date": "1/31/2018", 
        "Title (IGNORE)": "An act to amend Tennessee Code Annotated, Title 4; Title 5; Title 6; Title 7; Title 10; Title 12; Title 65; Title 67 and Title 68, relative to internet neutrality (companion to HB 2253)", 
        "Sponsor(s)": "Harris (D)", 
        "Type": "Bill"
    }, 
    "Wisconsin": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SB 743", 
        "Description": "Requires providers of broadband Internet access service to adhere to net neutrality principles; requires Department of Agriculture, Trade and COnsumer Protection to create and implement a complaint process for responding to violations of the bill's provisions. ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "SB 743", 
        "Date": "1/29/2018", 
        "Title (IGNORE)": "An Act to create 100.80 of the statutes; relating to: requirements and prohibited practices for Internet service providers and granting rule-making authority (companion to AB 909)", 
        "Sponsor(s)": "Senators Larson (D), Risser (D), Vinehout (D), Hansen (D), Carpenter (D), Johnson (D), Bewley (D); Assemblymembers Anderson (D), Brostoff (D), Hebl (D), Vruwink (D), Berceau (D), Ohnstad (D), Taylor (D), Sinicki (D), Spreitzer (D), Crowley (D), Shankland (D)", 
        "Type": "Bill"
    }, 
    "Iowa": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "S.F. 2286", 
        "Description": "Requires a communications service provider to publish a provider's reasonable network management practices, performance, and commercial terms of its broadband service and prohibits communications service providers from blocking lawful content, applications, services, or nonharmful devices, unless pursuant to a reasonable network management practice.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "S.F. 2286", 
        "Date": "2/14/2018", 
        "Title (IGNORE)": "Iowa Internet Neutrality Act (companion to H.F. 2287)", 
        "Sponsor(s)": "Bowman (D)", 
        "Type": "Bill"
    }, 
    "Michigan": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SR 131", 
        "Description": "Resolution urging the Governor to issue an executive order requiring internet service providers with state contracts to abide by net neutrality principles", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "SR0131", 
        "Date": "2/21/18", 
        "Title (IGNORE)": "", 
        "Sponsor(s)": "Bieda (D)", 
        "Type": "Resolution"
    }, 
    "Kansas": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H.B. 2682", 
        "Description": "Prohibits state contracts with internet service providers that do not adhere to net neutrality principles", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "HB 2682", 
        "Date": "2/7/2018", 
        "Title (IGNORE)": "Prohibiting state contracts with internet service providers that do not adhere to net neutrality principles.", 
        "Sponsor(s)": "Parker (D), Clayton (R), Curtis (D), Highberger (D), Ohaebosim (D), Probst (D)", 
        "Type": "Bill"
    }, 
    "Virginia": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 705", 
        "Description": "Prohibits a provider of broadband services from offering or renewing services to consumers within any locality in the Commonwealth in which certain media is throttled, blocked, or prioritized on the basis of its content, format, host address, or source.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HB 705", 
        "Date": "1/9/2018", 
        "Title (IGNORE)": "A bill to amend the Code of Virginia by adding in Article 7 of Chapter 21 of Title 15.2 a section numbered 15/2-2161, relating to broadband services; prohibited features. ", 
        "Sponsor(s)": "Sponsors: Carter (D), Roem (D); co-sponsors: Hope (D), Plum (D), Price (D), Rasoul (D), Simon (D)", 
        "Type": "Bill"
    }, 
    "Oregon": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 4155", 
        "Description": "Prohibits public bodies from contracting with broadband Internet access service providers that engage in certain network management activities based on paid prioritization, content blocking or other discrimination", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HB 4155", 
        "Date": "1/22/2018", 
        "Title (IGNORE)": "Relating to Internet service providers; and declaring an emergency", 
        "Sponsor(s)": "Williamson (D), Holvey (D), Leon (D), Barker (D), Barnhart (D), Bynum (D), Clem (D), Doherty (D), Fahey (D), Gomberg (D), Gorsek (D), Greenlick (D), Helm (D), Hernandez (D), Keny-Guyer (D), Kotek (D), Lively (D), Malstrom (D), Marsh (D), McLain (D), Nathanson (D), Nosse (D), Piluso (D), Power (D), Rayfield (D), Salinas (D), Sanchez (D), Warner (D), Sollman (D), Frederick (D), Gelser (D), Taylor (D)", 
        "Type": "Bill"
    }, 
    "Connecticut": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H.B. 5260", 
        "Description": "Require Internet service providers that are state contractors to adopt a net neutrality policy.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "H.B. 5260", 
        "Date": "2/26/2018", 
        "Title (IGNORE)": "An Act Requiring State Contractors to Adopt a Net Neutrality Policy", 
        "Sponsor(s)": "Winkler (D), Albis (D), Dillon (D), Slap (D)", 
        "Type": "Bill"
    }, 
    "Montana": {
        "City (if it's city level)": "", 
        "Status": "Signed 1/22/2018; effective 1/22/2018", 
        "SourceURL": "MT Executive Order", 
        "Description": "Directs the Department of Administration to incorporate into the state procurement process for internet, data, and telecommunications services criteria requiring recipients of state contracts to\nadhere to internet neutrality principles. ", 
        "Bipartisan?": "", 
        "Legislation (highlight=confirmed)": "EO No. 3-2018", 
        "Date": "1/22/2018", 
        "Title (IGNORE)": "Executive Order Providing for Internet Neutrality Principles in State Procurement", 
        "Sponsor(s)": "Governor Steve Bullock (D)", 
        "Type": "Executive Order"
    }, 
    "California": {
        "City (if it's city level)": "", 
        "Status": "Adopted 2/12/2018", 
        "SourceURL": "SR 74", 
        "Description": "Urges the FCC to reinstate the 2015 Open Internet Order and urges Congress to intervene to protect net neutralityt and codify its principles in statute", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "SR 74", 
        "Date": "1/22/2017", 
        "Title (IGNORE)": "Relative to Net Neutrality", 
        "Sponsor(s)": "De Leon (D), Wiener (D), Allen (D), Atkinds (D), Beall (D), Bradford (D), Dodd (D), Hernandez (D), Hertzberg (D), Hill (D), Hueso (D), Jackson (D), Lara (D), Leyva (D), McGuire (D), Mitchell (D), Monning (D), Newman (D), Pan (D), Portantino (D), Roth (D), Skinner (D), Stern (D), Wieckowski (D)", 
        "Type": "Resolution"
    }, 
    "Massachusetts": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H 4151", 
        "Description": "An entity engaged in the provision of broadband internet access service in Massachusetts may not block lawful content; impair or degrade lawful internet traffic on basis of content, application, or service, or use of nonharmful device; or enage in paid priorization.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "H4151", 
        "Date": "12/28/2017", 
        "Title (IGNORE)": "An Act Protecting Consumers by Prohibiting Blocking, Throttling, or Paid Prioritization in the Provision of Internet Service ", 
        "Sponsor(s)": "Vargas (D), Hecht (D), Ashe (D), Atkins (D), Balser (D), Barber (D), Barrett (D), Benson (D), Cantwell (D), Carvalho (D), Chang-Diaz (D), Connolly (D), Day (D), DiZoglio (D), Driscoll (D), Farley-Bouvier (D), Fernandes (D), Garballey (D), Garlick (D), Garry (D), Gentile (D), Goldstein-Rose (D), Haddad (D), Higgins (D), Holmes (D), Jehlen (D), Kafka (D), Khan (D), Kocot (D), Koczera (D), Kulik (D), L'Italien (D), Jack Lewis (D), Jason Lewis (D), Linsky (D), Madaro (D), Malia (D), Mark (D), Matias (D), McMurtry (D), Miceli (D), Moran (D), Muratore (R), Murray (D), Naughton (D), O'Connor (R), O'Day (D), Peake (D), Pignatelli (D), Provost (D), Rogers (D), Roy (D), Rushing (D), Stanley (D), Straus (D), Ultrino (D), Vega (D), Vincent (D), Chris Walsh (D), Thomas Walsh (D)", 
        "Type": "Bill"
    }, 
    "West Virginia": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H 4399", 
        "Description": "Requires internet service providers to publicly disclose accurate information about network management practices, performance, and commercial terms of use; requires providers to adhere to net neutrality principles ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "H 4399", 
        "Date": "2/1/2018", 
        "Title (IGNORE)": "A bill to amend the Code of West Virginia, 1931, as amended, by adding thereto a new article, designated §1-7-1, §1-7-2 and §1-7-3, all relating to net neutrality for state government; providing legislative findings; defining terms; requiring the state to utilize net neutral internet services and associated activities; and providing exceptions thereto.", 
        "Sponsor(s)": "Primary: Lovejoy (D); Sponsors: Canestraro (D), R. Miller (D), Fluharty (D), Hornbuckle (D), Robinson (D), Sponaugle (D), Barrett, (D) Byrd (D), Williams (D), Isner (D)", 
        "Type": "Bill"
    }, 
    "South Carolina": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB4706", 
        "Description": "Requires telecommunications or Internet service provider engaged in the provision of broadband Internet access service publicly to disclose acruate information regarding the network management practices, performance, and commercial terms of its broadband Internet access services sufficient for consumers to make informed choices regarding use of such services and for content, application, service and device. Requires service providers to adhere to net neutrality principles.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "H 4706", 
        "Date": "1/24/2018", 
        "Title (IGNORE)": "South Carolina Net Neutrality Protection and Maintenance Act", 
        "Sponsor(s)": "Smith (D)", 
        "Type": "Bill"
    }, 
    "Vermont": {
        "City (if it's city level)": "", 
        "Status": "Enacted; signed by Governor May 22, 2018, effective 7/1/2018", 
        "SourceURL": "S 289", 
        "Description": "Requires internet service providers to comply with consumer protection and net neutrality standards. State procurement contracts for broadband internet access service require the internet service provider to certify that it is in compliance with consumer protection and net neutrality standards.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "S 289", 
        "Date": "1/3/2018", 
        "Title (IGNORE)": "An act relating to protecting consumers and promoting an open Internet in Vermont", 
        "Sponsor(s)": "Primary: Lyons (D); cosponsors: Sirotkin (D), Ashe (D)", 
        "Type": "Bill"
    }, 
    "Georgia": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SB 310", 
        "Description": "Requires any Internet Service Provider engaged in the provision of broadband Internet access service must publicly disclose accurate information regarding the network management practices, performance, and commercial terms of its broadband Internet access service; requires internet service providers to adhere to net neutrality rules.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "SB 310", 
        "Date": "12/18/2017", 
        "Title (IGNORE)": "An Act to Amend Title 46 of the Official Code of Georgia Annotated", 
        "Sponsor(s)": "Harold (D), Henson (D), Tate (D), Jordan (D), Seay (D), Williams (D)", 
        "Type": "Bill"
    }, 
    "Pennsylvania": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "SB 1033", 
        "Description": "Provides for disclosure requirements for broadband Internet access service providers. Requires internet service providers to adhere to net neutrality principles. Prohibits a Commonwealth agency or political subdivision from contracting or awarding grants or tax credits to a provider that does not comply. Imposes civil penalties.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "SB 1033", 
        "Date": "2/9/2018", 
        "Title (IGNORE)": "Open Internet Protection Act", 
        "Sponsor(s)": "Farnese (D), Blake (D), Schwank (D), Taraglione (D), Costa (D), Williams (D)", 
        "Type": "Bill"
    }, 
    "Alaska": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HJR 31", 
        "Description": "A resolution urging the United States Congress to overturn the FCC's order ending net neutrality through CRA", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HJR 31", 
        "Date": "1/26/2018", 
        "Title (IGNORE)": "A resolution urging the United States Congress to overturn the FCC's order ending net neutrality through CRA", 
        "Sponsor(s)": "Kawasaki (D), Parish (D), Fansler (D), Tuck (D), Drummond (D), Gara (D), Spohnholz (D)", 
        "Type": "Resolution"
    }, 
    "Kentucky": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 418", 
        "Description": "Requires broadband Internet access service providers doing business with the state under the Kentucky Model Procurement Act to adhere to certain network management practices; creates the Fair Access to the Internet Act to protect consumers from broadband Internet access service providers who fail to adhere to reasonable network management practices.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HB 418", 
        "Date": "2/21/2018", 
        "Title (IGNORE)": "An Act Relating to Internet Service Providers", 
        "Sponsor(s)": "Cantrell (D)", 
        "Type": "Bill"
    }, 
    "Hawaii": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 1995", 
        "Description": "Requires ISPs operating in HI to comply with network neutrality rules and to be transparent with its network management practices, performance, and commercial terms of its internet services.", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "HB 1995", 
        "Date": "1/22/2018", 
        "Title (IGNORE)": "Relating to Broadband Internet Access", 
        "Sponsor(s)": "Ing (D), Creagan (D), Gates (D), Johanson (R), Keohokalole (D), Lowen (D), Mizuno (D), Brower (D)", 
        "Type": "Bill"
    }, 
    "Nebraska": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "L.B. 856", 
        "Description": "Requires internet service providers (ISPs) to publicly disclose accurate information concerning network management practices, performance and commercial terms of service; requires ISPs to adhere to net neutrality principles unless there is a demonstrated public interest. ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "L.B. 856", 
        "Date": "1/5/2018", 
        "Title (IGNORE)": "Internet Neutrality Act", 
        "Sponsor(s)": "Morfeld (D)", 
        "Type": "Bill"
    }, 
    "Missouri": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 1994", 
        "Description": "Requires internet service providers to publicly disclose accurate information regarding the network management practices, performance, and commercial terms; and adhere to net neutrality principles; permits paid prioritization if there is a demonstrated public interest. ", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HB1994", 
        "Date": "1/9/2018", 
        "Title (IGNORE)": "", 
        "Sponsor(s)": "Sponsor: Ellebracht (D)", 
        "Type": "Bill"
    }, 
    "Ohio": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HCR 18", 
        "Description": "To encourage the President and Congress to continue to protect net neutrality and open Internet access", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "HCR 18", 
        "Date": "12/04/2017", 
        "Title (IGNORE)": "A Concurrent Resolution to Memorialize the President and Congress to continue to protect net neutrality and open internet access", 
        "Sponsor(s)": "West (D), Ramos (D), Lepore-Hagan (D), Stein (R), Sheehy (D), Holmes (D), Ingram (D), Miller (D), Howse (D)", 
        "Type": "Resolution"
    }, 
    "New York": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "A09057", 
        "Description": "Requires broadband internet access service providers to publicly disclose accurate information regarding network management practices, performance, and commercial terms. Requires state contracts to be with internet service providers that are compliant with net neutrality and establishes a revolving fund for the establishment of municipal internet service providers; appropriates $250 million therefor.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "A09057", 
        "Date": "1/18/2018", 
        "Title (IGNORE)": "An Act to Amend the Public Services Law and State Finance Law, in Relation to State Contracts Being only with Internet Service Probhivers Compliant with Net Neutrality and Establishes a Revolving Fund for the Establishment of Municipal Internet Service Providers; and Making an Appropriation Therefor (companion bill S07175)", 
        "Sponsor(s)": "Cahill (D), Colton (D), Quart (D), Jaffee (D), Hyndman (D), Lavine (D), Sepulveda (D), Englebright (D), Zebrowski (D), Crespo (D), Wright (D), Rosenthal (D), D'Urso (D), Hevesi (D), Mosley (D), Simon (D), Bronson (D), Gunther (D), Blake (D), Montesano (R), Aubry (D), Bichotte (D), Peoples-Stokes (D), Niou (D), Hunter (D), De La Rosa (D), Lentol (D), Thiele (D)", 
        "Type": "Bill"
    }, 
    "South Dakota": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "Senate Bill 195", 
        "Description": "Establishes certain provisions regarding the state procurement process for internet, data, and telecommunications services. Requires a service provider to publicly disclose all of its customers in the state, accurate information regarding network and transport management practices, performance and commercial terms. Requires service providers contracting with the state to adhere to net neutrality principles.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "S.B. 195", 
        "Date": "2/1/2018", 
        "Title (IGNORE)": "", 
        "Sponsor(s)": "Senators Nesiba (D), Frerichs (D), Heinert (D), Kennedy (D), Killer (D); Representatives Ring (D), Bartling (D), Bordeaux (D), Hawley (D), Lesmeister (D), McCleerey (D), Wismer (D)", 
        "Type": "Bill"
    }, 
    "Colorado": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "HB 1312", 
        "Description": "Disqualifies an internet service provider from receiving high cost support mechanism money or other money received to finance broadband deployment if the internet service provider engages in certain practices that interfere with the open internet and requiring an internet service provider that engages in such practices to refund any such money received.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "HB 1312", 
        "Date": "3/22/2018", 
        "Title (IGNORE)": "Open Internet Customer Protections In Colorado", 
        "Sponsor(s)": "Reps. Hansen (D), Herod (D), Senator Donovan (D)", 
        "Type": "Bill"
    }, 
    "New Jersey": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "A2139", 
        "Description": "Requires cable television company to commit to principle of “net neutrality” as a condition of approval of applications for municipal consent or system-wide franchise", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "A2139", 
        "Date": "1/9/2018", 
        "Title (IGNORE)": "An Act Concerning Cable Television Service ", 
        "Sponsor(s)": "Sponsors: Chiaravalloti (D), Zwicker (D), Calabrese; co-sponsors: Murphy (D), Mukherji (D), Swain (D), Tully (D)", 
        "Type": "Bill"
    }, 
    "Washington": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H 2284", 
        "Description": "Prohibits a person engaged in the provision of broadband internet access service from: (1) Blocking lawful content, applications, services, or nonharmful devices; (2) Impairing or degrading lawful internet traffic on the basis of internet content, application, or service, or use of a nonharmful device; or (3) Engaging in paid prioritization. Authorizes the utilities and transportation commission to waive the prohibition on paid prioritization under certain circumstances.", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "HB 2284", 
        "Date": "12/14/2017", 
        "Title (IGNORE)": "An act relating to protecting consumers by prohibiting blocking, throttling, or paid prioritization in the provision of internet service in Washington state; adding a new chapter to Title 19 RCW; and providing a contingent effective date.", 
        "Sponsor(s)": "Smith (R), Cody (D), Tarleton (D), DeBolt (R), Springer (D), Santos (D), McBride (D), Chapman (D), Wylie (D), Fitzgibbon (D), Peterson (D), Morris (D), Stonier (D), Kagi (D), Senn (D), Kirby (D), Stanford (D), Blake (D), Reeves (D), Kilduff (D), Clibborn (D), Macri (D), Pettigrew (D), Orcutt (D), Stambaugh (D), Ormsby (D), Ryu (D), Hayes (R), Pollet (D), Doglio (D), Ortiz-Self (D), Riccelli (D), McDonald (R), Jinkins (D), and Gregerson (D)", 
        "Type": "Bill"
    }, 
    "North Carolina": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H.B. 1016", 
        "Description": "Prohibits state agencies from contracting with broadband providers that do not adhere to net neutrality principles.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "H 1016", 
        "Date": "5/24/2018", 
        "Title (IGNORE)": "Net Neutrality in Procurement", 
        "Sponsor(s)": "Martin (D), John (D), Meyer (D), Beasley (D), Adcock (D), Autry (D), Ball (D), Belk (D), Fisher (D), Harrison (D), Insko (D), Morey (D), Richardson (D)", 
        "Type": "Bill"
    }, 
    "District of Columbia": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "PR22-0691", 
        "Description": "Resolution to encourage Congress to block the repeal of Net Neutrality Rules from takeing effect and to support any future efforts to codify a free, fair, and open Internet.", 
        "Bipartisan?": "N", 
        "Legislation (highlight=confirmed)": "PR22-0691", 
        "Date": "12/19/2017", 
        "Title (IGNORE)": "Sense of the Council Oposing the Repeal of Net Neutrality Rules Resolution of 2017", 
        "Sponsor(s)": "Councilmembers Nadeau (D), Grosso (I), Silverman (I), Cheh (D), Allen (D), McDuffie (D), T. White (D), Todd (D), Gray (D), Bonds (D), R. White (D), Evans (D); Chairman Mendelson (D)", 
        "Type": "Resolution"
    }, 
    "Rhode Island": {
        "City (if it's city level)": "", 
        "Status": "Not passed", 
        "SourceURL": "H 7422", 
        "Description": "Any Internet access services purchased or funded by the state or municipality must be provided in an unbiased manner, consistent with net neutrality principles, so as to meet the state or municipality's minimum standards as the purchaser or funder of such services. ", 
        "Bipartisan?": "Y", 
        "Legislation (highlight=confirmed)": "H 7422", 
        "Date": "02/02/18", 
        "Title (IGNORE)": "The Net Neutrality Protection Act of 2018", 
        "Sponsor(s)": "Regunberg (D), O'Grady (D), Ruggiero (D), Ajello (D), Filippii (I)", 
        "Type": "Bill"
    }
}